Revit 2027 API
ScheduleField Properties
The ScheduleField type exposes the following members.
Properties
Name | Description
ColumnHeading |  The column heading text.
Definition |  The ScheduleDefinition that this field belongs to.
DisplayType |  Indicates the chosen display type for the field.
FieldId |  The ID of the field in the containing ScheduleDefinition.
FieldIndex |  The index of the field in the containing ScheduleDefinition.
FieldType |  The type of data displayed by the field.
GridColumnWidth |  The width of the column in the editable grid view, measured in feet.
HasSchedulableField |  Identifies if this ScheduleField object has access to a SchedulableField. Calculated and combined parameter fields will not have the access.
HeadingOrientation |  The orientation of the column heading text.
HorizontalAlignment |  The horizontal alignment of the column's data.
IsCalculatedField |  Indicates if the field is a calculated field (Formula or Percentage).
IsCombinedParameterField |  Indicates if the field is a combined parameter field.
IsHidden |  Indicates if the field is hidden in the schedule.
IsOverridden |  Indicates if the field is overridden or not.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
MultipleValuesCustomText |  The custom multiple values text to be used when the schedule field displays multiple element values, used when MultipleValuesDisplayType is set to Custom.
MultipleValuesDisplayType |  Determines the type of multiple value indication to be used when the schedule field displays multiple element values.
MultipleValuesText |  The multiple values text to be used when the schedule field displays multiple element values, as specified by the display type MultipleValuesDisplayType.
ParameterId |  The ID of the parameter displayed by the field.
PercentageBy |  The ID of the grouped schedule field used to calculate percentage totals.
PercentageOf |  The ID of the field to calculate percentages of.
Schedule |  The schedule that this field belongs to.
SheetColumnWidth |  The width of the column on a sheet, measured in feet.
TotalByAssemblyType |  In an assembly schedule view, indicates if totals are calculated for all assembly instances of the same type or only for a single instance.
VerticalAlignment |  The vertical alignment of the column's data.
Top
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace